turmoil
grip
stock
market
expert
predict
month
come
swing
pendulum
greed
fear
firmly
peg
sentiment
investor
turn
strategy
capital
preservation
fences.not
surprisingly
recent
dip
create
surge
traditional
defensive
play
precious
metal
treasury
bond
utility
asset
class
display
inverse
relationship
rate
reassuring
embrace
physical
intrinsic
monetary
quality
allure
oversized
cash
money
position
temporary
feeling
relief
swirl
uncertainty
stocks.however
problem
conventional
safe
haven
decide
it’s
appropriate
risk
lose
headway
gain
period
volatility
furthermore
difficult
accurately
time
mood
day
basis
lead
jump
ill-timed
moment
bad
opportunity
sit
sideline
second
guess
new
data
point
churn
higher.rather
constant
game
cat
mouse
individual
sector
tactic
institute
conservative
approach
tune
tolerance
start
reduce
focus
high
growth
momentum
favor
publicly
trade
company
history
below-average
volatility.the
ishares
msci
usa
minimum
etf
usmv
powershares
low
splv
example
fund
systematically
select
subset
large-cap
historical
characteristic
minimal
price
fluctuation
mean
underlying
susceptible
downside
cap
weight
index
spdr
spy
addition
offer
multi-sector
diversification
fundamentally
sound
property
suitable
core
holding
cyclical
bull
type
likely
hold
correction
try
important
evaluate
allocation
size
sleeve
portfolio
accord
feel
heightened
level
anxiety
sign
pair
stock-focused
build
well-balanced
overwhelming
advantageous
look
multi-asset
solution
moderate
aom
“fund
funds”
style
invest
mix
goal
simplicity
single
investment
vehicle
automatically
rebalanced
regular
diversified
low-cost
way
hassle
pick
combination
help
offset
drawdown
tumult
similar
alternative
enhanced
international
commodity
cambria
global
gaa
balanced
incorporate
result
underlie
management
fee
expense
transaction
purchase
alongside
pas
make
extremely
reasonable
virtually
large
world
fund.the
linethere
numerous
successfully
overall
mitigate
option
mention
concern
transient
instability
wish
disciplined
reach
long-term
disclosure
article
write
author
client
fmd
share
subscriber
flexible
income
report
pervade
initial
week
common
phenomenon
popularly
know
“flight
quality”
essentially
sell
u.s.
government
event
occur
early
stage
frenzied
buying
skeptical
continued
vertical
ascent
compare
relative
valuation
area
subsequently
saw
sharp
peak
20+
year
tlt
reversal
turning
tide
stocks.the
chart
room
fall
far
allow
long
re-test
prior
certainly
pressure
add
fuel
throw
towel
rush
safety
performance
story
demonstrating.however
picture
different
intermediate-term
7-10
ief
effective
duration
proxy
middle
yield
curve
benchmark
fixed-income
target
responsiveness
rates.ief
close
test
yesteryear
key
watch
indication
contrary
indicator
break
set
strength
despite
federal
reserve’s
intention
raise
short-term
appear
concerned
fed’s
bluff
ill
effect
rise
rates.another
factor
weigh
outcome
inverted
nature
versus
current
30-day
10-year
note
tnx
typically
happen
ratchet
return
buyer
ultimately
reverse
initiate
release
mechanism
classes.it
say
critical
crossroad
term
overdue
function
natural
ebb
flow
certain
trend
persist
think
possible
present
obstacle
circumvent
trading
book
ready
sanctuary
major
miserable
question
success
fortunately
transparency
exchange-traded
creation
redemption
process
unique
perspective
buy
tumultuous
tool
etf.com
excellent
resource
task
past
customized
setting
year-to-date
quarter
timeframes
number
inflow
unsurprisingly
vanguard
offering
voo
million
opportunistic
capitalize
light
signal
yearning
allocate
expectation
bounce
near
future
experience
grand
total
billion
net
vanguard’s
commitment
transparent
live
investors’
list
shift
nervous
reit
consumer
staple
gold
respond
pull
assumption
plow
diverge
performance.the
real
estate
iyr
beneficiary
fresh
trust
relatively
steady
half
decline
outperformance
drive
accommodative
flag
demand
yield-related
tie
energy
sector.not
form
barclays
1-3
shy
manage
accumulate
additional
invests
basket
consider
ultra-safe
uptick
regard
combine
modestly
lastly
xlp
track
engage
food
beverage
essential
household
retail
product
draw
stalwart
business
model
inelastic
lend
continue
reliability
downturn
lineoverall
tepid
hesitation
wait
clearer
emerge
provide
insight
supportive
source
1/1/16
1/7/16
prediction
run
gamut
extension
all-time
apprehension
bear
cycle
sprinkle
expect
outperform
environment
instance
recently
interview
david
mazza
vice
president
head
research
ssga
recommendation
include
reason
regional
banking
kre
homebuilder
xhb
technology
xlk
text
access
forecast
generally
solid
technical
fundamental
theme
tailwind
specific
predicate
continuation
exist
niche
industry
significantly
underperform
vti
simply
educate
base
guarantee
effective.with
mind
tip
improve
funds.sector
sessionthe
hit-or-miss
intermediate
experienced
concentrated
corner
attractive
seek
boost
equity
proliferation
sponsor
strong
menu
vary
construction
big
determining
methodology
market-cap
weighted
equal
variant
weakness
examine
context
thesis
ratio
liquidity
greatly
treat
tactical
building
block
small
order
maintain
exposure
doesn’t
overcommit
like
easy
integrate
portfolio.the
use
transaction-free
popular
online
broker
best
arena
elimination
increment
need
friction
great
flexibility
adjustment
time.furthermore
behoove
miss
group
diversify
enhance
chance
peer
motto
“don’t
egg
basket”
construct
etfs.the
linethe
cost
investing
compliment
surprise
cut
bank
japan
rally
friday
dow
jones
industrial
average
two-week
wall
street
divorce
oil
weekly
nasdaq
end
red
largely
freefall
linger
china
impact
economy
january
shoot
late
night
lower
excess
reserve
leave
open
possibility
accommodation
wednesday
shrug
anemic
pace
economic
slow
remain
mixed
little
change
hike
n't
june
november
deficit
good
widen
employment
increase
as-expected
later
chicago
purchasing
manager
contractionary
december
estimate
45.5.
finally
final
university
michigan
decayed
preliminary
read
93.3.
corporate
news
xerox
xrx
better-than-expected
earnings
split
separate
unit
amazon
amzn
shipping
component
visa
microsoft
msft
performer
beat
eps
revenue
thanks
cloud
service
commercial
office
stand
composite
ftse
nikkei
hang
seng
shanghai
upside
mover
sdpi
ink
deal
supply
drill
equipment
baker
hughes
axll
reject
20-per-share
westlake
chemical
corp
wlk
sne
fiscal
exceed
analyst
ino
extend
thursday
zika
virus
outbreak
flex
sale
issue
guidance
in-line
alv
delivery
volume
replacement
airbag
inflator
delay
worse-than-expected
gild
ceo
john
martin
chairman
coo
milligan
promote
tsx
ahead
mid-afternoon
session
recovery
financial
copper
higher
afternoon
support
mining
2.064/lb
prospect
cutback
hand
1,116.80/ounce
benefit
safe-haven
amid
volatile
brent
crude
34.54/barrel
choppy
widespread
advance
follow
healthcare
financials
modest
bombardier
bbd-b.to
actively
traded
following
percentage
decliners
venture
exchange
movement
softrock
sof.v
canyon
creek
cyf.v
newcastle
ngy-h.v
anfield
ary.v
centenara
ct.v
cobra
cbv.v
manitex
mnx.v
prosper
pgx.v
tirex
txx.v
contagious
gaming
cns.v
gainer
halmont
hmt.v
blumetric
environmental
blm.v
profound
medical
prn.v
desert
star
dsr.v
pacific
booker
mineral
bkm.v
diamcor
dmi.v
sqi
diagnostics
sqd.v
eqube
eqg.v
naturally
splendid
enterprise
nsp.v
frankly
tlk.v
pre-market
yinn
gasl
rusl
yang
sco
broad
broad-market
iwm
ivv
weak
actively-traded
qqq
fell
confirm
country
official
manufacture
drop
three-year
missed
personal
spending
monday
8:30
a.m.
par
previously
consumption
expenditure
pce
unchanged
power
iye
flat
xle
dominion
nearly
agree
acquire
salt
lake
city-based
questar
corporation
str
assume
outstanding
debt
mid-point
52-week
range
upper
winner
loser
lean
iyw
north
american
igm
technology-software
igv
inactive
ipk
semiconductor
xsd
soxx
sohu.com
sohu
marginally
loss
firm
non-gaap
dilute
narrow
consensus
slip
year-over-year
view
spdrs
xlf
direxion
daily
fa
faz
stifel
european
broker-dealer
ism
independent
undisclosed
acquisition
origination
capability
europe
end-to-end
platform
convertible
security
statement
united
state
uso
gas
tumble
ung
gld
silver
slv
iyk
vdc
discretionary
xly
xrt
dynamic
pmr
vector
rth
carmax
kmx
nash
cliff
wood
chief
operate
officer
feb.
succession
plan
tom
folliard
retire
retirement
role
used
car
retailer
join
executive
human
administrative
store
responsible
merchandising
health
care
xlv
edge
iyh
vht
biotech
biotechnology
ibb
cardinal
cah
post
reaffirm
diluted
gaap
active
velocityshares
etn
uwti
vix
ipath
vxx
eem
jnj
pze
mrk
abt
amgn
today
nyse
align
inc.
algn
record
medical-device
projection
exclude
one-time
item
earn
october-to-december
adjust
profit
forward
march
qlogic
project
per-share
apiece
earlier
best-ever
chinese
authority
patent
cover
manf
neurodegenerative
condition
protein
gene
cell
therapy
iccc
mln
public
1.l
discount
closing
tech
aapl
ibm
csco
goog
sharply
corp.
qlgc
server
storage
chipmaker
forecasting
dec.
960,000
portion
morning
gimo
climb
azpn
introduce
negative
attempt
spur
inflation
germany
national
turnover
nominal
previous
grow
dax
vonovia
fresenius
infineon
laggard
thyssenkrupp
eon
volkswagen
respectively
u.k.
export
travel
transport
netherlands
contribute
import
london
inmarsat
isat
old
mutual
oml
tesco
tsco
glencore
plc
glen
antofagasta
anto
bhp
billiton
french
bourse
airbus
cac
pernod
ricard
safran
arcelormittal
valeo
peugeot
cac-40
straight
unexpected
bearish
lift
200-point
blue-chip
above-consensus
overnightafter
produce
fourth
interest-rate
reading
easily
decay
cloud-services
bullish
eu-zone
cent
barrel
btu
1,116.90
ounce
penny
pound
precious-metal
miner
mid-day
9,548.71
16,343.27
1,925.06
4,575.62
wmt
mcd
dis
cvs
westrock
co.
wrk
annual
year-ago
short
just
ago
merger
rocktenn
meadwestvaco
confident
meet
identify
synergy
stay
jpy95.33
jpy21.64
jpy2580.8
bln
jpy2523.1
lags
jpm
bac
wfc
usb
broadly
upstaging
trail
payment
constant-dollar
trillion
processed
visanet
recover
slide
slightly
underwater
lmrk
distribution
represent
row
dividend
cobz
complete
analysis
impairment
cause
loan
college
provision
xom
cvx
cop
slb
oxy
consol
cnx
producer
suspend
series
cumulative
perpetual
preferred
glp
neutral
overweight
mitsubishi
ufj
positive
enter
noon
reflect
continuous
cancel
2.0595/lb
freeport
mcmoran
right
concentrate
giant
grasberg
indonesia
1,117/ounce
yellow
midday
russia
meeting
schedule
opec
33.81/barrel
telecom
shed
stood
depository
receipt
york
mellon
adr
pharmaceutical
continental
cellectis
clls
paris-based
developer
immuno-oncology
barcelona-based
grifols
grfs
specialty
biopharmaceutical
norway
statoil
sto
adaptimmune
therapeutic
adap
london-based
drugmaker
astrazeneca
azn
telecommunication
vodafone
vod
unilever
geoscience
cgg
steelmaker
geneva-based
stmicroelectronics
stm
bbl
rio
tinto
ease
tsxv
intercept
ies.v
canadian
platinum
cpc.v
cornerstone
ccc.v
greenshield
exploration
grx-h.v
network
net.v
sego
sgz.v
stans
hre.v
jaguar
jfc.v
asian
asia
japanese
central
lending
zero
stimulus
stoke
apply
account
institution
effectively
charge
entertainment
sony
medium
outlet
quarterly
ntt
docomo
dcm
announce
buyback
bloomberg
toyota
motor
southern
telekomunikasi
tlk
indian
infosys
infy
phoenix
feng
content
hotel
lodge
htht
decision
mtu
mizuho
mfg
bny
canada
decides
adopt
policy
crash
hope
reduction
output
check
34.27/barrel
wti
33.58/barrel
announcement
pre-empt
whirlpool
whr
amazon.com
mastercard
chevron
abbvie
abbv
slump
digest
commerce
department
expand
october
bureau
labor
statistic
seasonally
etfs
vs.
comparable
counterpart
deutsche
touch
germany-based
regulatory
filing
eur
compile
full-year
fy14
division
production
approximately
anticipate
coal
27-32
ton
macy
timing
brooklyn
fulton
tishman
speyer
renovate
recognize
dependent
received
receive
entire
sees
dr.reddy
laboratory
rdy
fda
approve
zembrace
symtouch
injection
treatment
acute
migraine
episode
adult
zembracesymtouch
promius
pharma
wholly-owned
dr.
reddy
black
worldwide
home
gdp
expected
econoday
9:45
a.m
e.t.
pmi
47.5.
10:00
93.5.
-dow
-nasdaq
ftse-100
dax-30
+/-
chip
software
hardware
internet
drug
airline
auto
hon
line
chronic
hepatitis
oks
aal
tops
reaffirms
health-care
pfe
mainly
merck
zepatier
breakthrough
designation
hcv
gt1
gt4
infection
pre-bell
straddle
cv
opening
bell
capiq
normalize
ongoing
figure
outlook
adjusted
simulate
sink
southside
bancshares
sbsi
board
director
repurchase
western
digital
wdc
electronic
art
after-hours
fy16
solidly
e.t
slowdown
sweet
heat
gallon
british
thermal
interoil
ioc
tot
subsidiary
png
partner-operator
petroleum
retention
license
gulf
province
papua
guinea
encounter
reservoir
antelope-6
appraisal
design
structural
control
definition
eastern
flank
antelope
field
2,076
meter
6,811
foot
true
depth
sub-sea
adrs
01/29/2016
premarket
avg
extended-hours
dollar
52,162
tyco
ltd.
tyc
upcoming
trader
immediately
relate
activity
indicate
extended
hour
limited
value
qtrs
reaction
percent
pro
mtnewswires.com
1,702,952
honeywell
2,975,058
3,427,808
5,775,040
8,714,511
seagate
stx
constructive
upbeat
disappointing
green
undermine
caterpillar
triple-digit
durable
briefly
caused
validate
committee
cautious
significant
transportation
communication
jobless
claim
greater-than-expected
16,000
285,000
pending
revise
initially
knee-jerk
extinguish
offensive
facebook
armour
trigger
saudi
arabia
deny
grind
3-week
balance
exp
univ
neos
adzenys
xr-odt
cifc
hire
morgan
explore
strategic
cmre
glop
osis
issued
jnpr
cfo
resignation
ebay
main
p/tsx
12,591
advancer
drag
valeant
vrx.to
penn
west
pwt.to
slash
budget
50-million
one-tenth
spend
potash
saskatchewan
pot.to
heavily
contract
plane
iran
rival
royal
ry.to
influential
score
potential
texas
mercantile
ice
finish
tally
attribute
so-called
headwind
three-month
marketwatch
april
most-active
settle
1,116.10
comex
february
pullback
tuesday
settlement
1,120
amedica
amda
presentation
silicon
nitride
ceramic
biomaterial
conference
begin
orthopaedic
society
orlando
fla.
demonstrate
variety
application
surgical
spine
joint
dental
sonny
bal
convincingly
limitation
biomaterials
medication
adhd
child
extended-release
orally
disintegrate
tablet
available
attention-deficit/hyperactivity
disorder
incy
stop
phase
sub-study
interim
ruxolitinib
bayer
regorafenib
sufficient
efficacy
patient
relapsed
metastatic
colorectal
cancer
crp
servicenow
cloud-based
28-month
prompt
downgrade
constant-currency
fy15
work
upstage
mkm
partner
trim
rbc
ntct
match
harman
har
september
electronics
narrowly
retreat
lag
oak
lob
saving
double
held-for-sale
held-for-investment
non-interest
comparison
early-morning
ghl
authorize
program
wrld
kirby
kex
five-year
shipper
weaker-than-expected
perform
soon
carry
memp
payable
reduces
mark
01/28/2016
1,674,201
supermicro
computer
smci
2,022,279
aspen
2,329,689
flextronics
indicates
2,601,150
netsuite
9,315,940
synaptics
syna
after-hoursavg
11,640,289fortinet
ftnt
close.last
reactionspercent
.last
close.data
11,770,374align
15,751,196western
18,808,537
kla-tencor
klac
meaningful
related
direction
22,078,669
30,875,267skyworks
swks
direction.data
61,393,406amgen
258,692,410microsoft
987,052,506amazon.com
noble
iron
nir.v
deq
deq.v
wavefront
wee.v
petrolympic
pcq.v
nca.v
aldever
ald.v
northern
vertex
nee.v
rpc.v
petroshale
psh.v
saturn
smi.v
mountain
wmt.v
toro
too.v
barrier
ibh.v
arrow
nar.v
urbanimmersive
ui.v
ironhorse
iog.v
canadream
cdn.v
aston
bay
bay.v
jinhua
jhc-h.v
30/barrel
tackle
russian
minister
alexander
novak
33.93/barrel
33.35/barrel
info
funding
lever
deflation
impactful
able
provider
limit
credit
suisse
believe
sheet
necessitate
bid-ask
spread
lack
private
alberta
royalty
review
degree
cdn
smid
space
2015e
2016e
downgradiing
transglobe
tgl.to
banker
bnk.to
brokerage
sole
outperform-rated
coverage
currently
parex
pxt.to
gran
tierra
gte.to
prefer
neutral-rated
team
rebalancing
deep
trough
rating
somewhat
condensate
rich
eventual
seven
generation
nuvista
gas-weighted
prefers
tourmaline
highlight
advantage
montney
healthy
self-funded
profile
shrank
organization
unusually
territory
social
user
mobile
year-on-year
monthly
advertising
fcfs
5-year
additionally
initiation
pay
bhi
oilfield
poll
halve
restructuring
merger-related
incyte
placebo
refractory
crc
c-reactive
planned
subgroup
plus
warrant
jakafi
first-in-class
jak1/jak2
inhibitor
administration
people
polycythemia
vera
bone
marrow
inadequate
response
intolerant
hydroxyurea
varian
var
device
tmsft
microstrategy
mstr
wide
margin
blowing
amd
sinclair
broadcast
sbgi
broadcaster
bid
cable
television
tennis
channel
reportedly
talk
closely
journal
tell
newspaper
operating
tax
liability
majority
private-equity
apollo
bain
battery
ccmp
columbia
satellite
directv
dish
stake
german
decrease
rwe
adidas
courier
by2.44
engineering
conglomerate
siemens
contribution
finance
restaurant
anglo
ashtead
carnival
france
technip
maker
renault
los
gemini
capstead
mortgage
cmo
beating
residential
reported
flotek
ftk
oilfield-services
yesterday
swung
recoup
selling
considerable
resistance
blue
flip-flopped
surrender
flush
reuters
propose
soar
reluctant
underpin
ford
overnight
defensively
ammunition
highly
switzerland
roche
9,388.23
16,036.57
1,897.32
4,518.57
hefty
cheer
34.34/barrel
33.45/barrel
mideast
cooperate
discuss
situation
organize
abu
dhabi
5,880
dubai
2,857
3,910
qatar
9,272
egypt
5,987
oman
5,017
kuwait
5,010
bahrain
1,172
historically
longs
post-earnings
earnings-driven
off-hours
database
decent
evening
've
deeper
oct.
july
guide
jan.
muscle
cratered
aug.
blow
slight
action
hit
plunge
eked
rebound
hammer
nov.
flock
aug
completely
erase
fatten
swell
rein
ground
plummet
pummel
hard
leap
barely
plummeted
deeply
whopping
slat
pattern
next-day
usually
fact
course
advanced
launch
bulk
south
claw
chunk
follow-on
bell-to-bell
evaporate
shave
heel
then-current
slender
improved
lower-than-expected
coming
steep
sank
stronger-than-expected
away
seller
tap
mount
longer-term
particularly
datapoint
suggest
wary
tonight
plus-side
flatline
slim
trrade
regain
slid
about-face
goose
earnings-related
broadcom
brcm
survey
tend
gross
crush
bolt
ramp
mere
inch
lower-than-normal
near-term
visibility
bit
estimate-beating
fizzle
fail
warn
tread
water
consistent
session-to-session
guiding
quite
replicate
legal
temper
fy05
aggressive
drugmakers
swiss
novartis
nvs
danish
novo
nordisk
nvo
sanofi
sny
dublin-based
shire
shpg
gwph
cannabinoid
medicine
italian
eni
standard
dutch
shell
rds.a
rds.b
strike
diamond
srk.v
africa
hydrocarbon
nfk-h.v
minecorp
mce.v
arian
arc.v
edgewater
edw.v
vantex
vax.v
superior
spc.v
omenica
omm.v
panoro
pml.v
mangazeya
mgz-h.v
manufacturer
tokyo-based
advantest
ate
taiwan
microelectronics
umc
quarter-over-quarter
wafer
shipment
express
optimism
foundry
india
videocon
d2h
vdth
operation
mol
molg
malaysian
alibaba
baba
lender
icici
ibn
tata
ttm
automaker
cite
speculation
decliner
calendar
corresponding
fertilizer
33.65/barrel
unexpectedly
overshadow
200-plus
sell-off
fomc
reassure
tone
persistently
unnerve
globe
robust
kick
278,000
twice
kansas
city
feed
11:00am
pypl
dent
worry
pan-european
stoxx
euro-region
bluechip
scale
rate-increase
frankfurt
crisis
ro.sw
low-
mid-singe
digit
clothing
hennes
mauritz
hm-b.st
correlation
establish
oil-related
tullow
tlw.l
seadrill
sdrl.ol
juniper
minus
declare
shareholder
robyn
denholm
resign
10-k
facilitate
smooth
transition
ken
miller
denhom
qualcomm
qcom
instrument
txn
facility
greenock
scotland
cost-effective
200-millimeter
fabs
maine
buoy
rank
willing
crowd
-8k
285k
tacitly
acknowledge
various
crop
discover
dfs
unclear
omx
ndaq
lee
shavel
ron
hassen
senior
controller
serve
shareowner
gocs
fed
2-year
notably
cfib
barometer
sized
erode
la
vegas
sand
lvs
holder
bristol-myers
squibb
bmy
mid-single
eli
lilly
lly
valero
vlo
prior-year
xcel
xel
yoy
exactly
affirm
1,164,470
bristol
myers
1,094,744
1,192,376
stanley
decker
swk
7,049,000
harley-davidson
hog
19,295,950
25,496,481
32,212,098
77,327,368
adverse
panel
post-meeting
monitor
development
assess
implication
boeing
apple
tupperware
tup
inventory
jan.22
1,116.30
end-of-day
15,944.46
1,882.95
4,468.17
capn
announces
exclusive
dealer
bemes
cosense
carbon
monoxide
sampling
disclose
trxc
johnson
buyout
robotic
surgery
bcei
proceeds
infrastructure
rocky
region
unidentified
midstream
lci
trails
sandisk
sndk
citigroup
memory-chip
iphone
kitchenware
august
eth
gabelli
upgrade
bah
santander
post-ipo
worst-ever
cof
tss
bonanza
pocket
29,000
consist
liquid
clr
non-acquisition
210,000
220,000
equivalent
221,000
bbg
ladenburg
thalmann
endure
anytime
12,377
material
rogers
rci-b.to
fourth-quarter
cgi
gib-a.to
trican
tcw.to
pump
baytex
bte.to
quantum
fm.to
agreement
domestic
1,118.30
01/27/2016
13,310,452
15,436,554
lam
lrcx
17,309,204
11,503,424
vrtx
18,222,104
20,265,742
citrix
ctxs
31,255,047
38,866,776
vega
78,278,551
178,925,536
held
minute
121-point
relation
objective
maximum
determine
targeted
baxalta
bxlt
secondary
baxter
bax
parent
assumed
onetime
directly
rnva
clinlab
georgia
county
wellness
fast
efficient
processing
reporting
lab
devin
dvc-h.v
greenbriar
grb.v
questfire
q-a.v
raimount
rmt.v
avrupa
avu.v
earthwork
ewk.v
lonestar
lsi.v
diamedica
dma.v
reo.v
canasil
clz.v
euromax
eox.v
orex
rex.v
sirona
biochem
sbm.v
delavaco
dvo-u.v
explor
exs.v
shaw
sjr-a.v
covalon
cov.v
flinders
fdr.v
mercury
mrcy
span
molson
coors
brew
beer-maker
overcome
bridge
tendency
consistency
floor
wash
motorcycle
expectati0ons
job
challenge
rev
artisan
apam
special
feb
690.3mln
widening
footing
subsequent
improvement
send
tack
evenly
guidace
fy08
disappointed
blowout
hiked
abrupt
kinder
kmi
pipeline
unsecured
expansion
revolving
general
purpose
repayment
44th
vault
handily
push
aggressively
ekes
higher-than-expected
steam
stretch
regualr
18-19
gather
considerably
weaken
2ith
downsidt
oct
clip
stellar
trump
favorably
post-market
caution
soft
pin
blew
skid
thrash
roar
blow-out
cross
wider
rocket
nugt
uco
urr
tqqq
bib
comment
bigger-than-expected
stall
clear
larger-than-expected
1/16
ex-transportation
nextera
nee
clean
successful
renewable
operator
place
rmb4.90
rmb2.29
rmb34,543
hershey
hsy
chocolate
sugar
confectionery
celgene
celg
deliver
extraordinary
approval
bob
hugin
ewj
confidence
synthetic
opinion
capacity
deteriorate
save
consistently
surround
fight
flood
lowered
catch
case
favoring
11/4/15
11/5/15
reg
7/29/15
7/30/15
4/22/15
4/23/15
1/28/15
1/29/15
10/28/14
10/29/14
7/23/14
7/24/14
4/23/14
4/24/13
1/29/14
1/30/14
10/30/13
10/31/13
7/24/13
7/25/13
5/1/13
5/2/13
1/30/13
1/31/13
10/23/12
10/24/12
7/26/12
7/27/12
impressive
tech-heavy
gauge
late-morning
barre
brace
conclusion
meeting.following
dial-back
rhetoric
housing
seasonally-adjusted
depressed
ricochet
seven-day
downbeat
sweden
ericsson
eric
banco
san
rb
turf
1,117.50
9,506.88
16,214.79
1,914.35
4,560.21
rumor
circulate
google
googl
appy
strand
life
science
seal
end-tidal
precision
sample
sune
greenlight
governance
transfirst
fate
ind
immunotherapy
protmune
conclude
stockpile
await
information
confirmation
two-day
transformation
bcs
lloyd
lyg
abengoa
abgb
spanish
restructure
set-top
box
fluctuate
hdfc
hdb
sumitomo
mitsui
smfg
melco
crown
mpel
owner
casino
resort
philippine
distance
telephone
phi
mumbai-based
jumei
jmei
beauty
jd.com
rediff.com
redf
vedanta
vedl
rockbridge
rbe.v
brunswick
bru.v
prime
meridian
pmr.v
arctic
add.v
rockland
rl.v
keli
electric
zkl.v
mincom
moi.v
cobalt
gco.v
softroc
spf.v
brand
imply
tal
education
xrs
ad
student
enrollment
477,960.
everbank
combined
non
bofa/merrill
lynch
stt
deyaar
dirham
islamic
hsbc
dib
effort
fifth
5,699
2,753
3,828
8,980
5,961
4,954
4,969
1,159
commvault
cvlt
attributable
breakeven
sequential
shut
discontinue
develop
set-top-box
gateway
generate
redeploy
employee
employ
eliminate
1,400
accept
biologics
bezlotoxumab
investigational
antitoxin
prevention
clostridium
difficile
recurrence
grant
priority
pdufa
date
file
marketing
authorisation
agency
nv
alcon
eye-care
currency
api
massive
31.64/barrel
30.87/barrel
anglo-dutch
takeover
london-listed
stockholder
vote
gdx
likewise
resume
p.m.
utx
biogen
biib
bok
bokf
10-12
4-6
idec
poise
prove
2:00
chair
janet
yellen
500,000
490,000
483,000
520,000
bright
spot
tex
30/share
zoomlion
cfg
replace
pcp
initiative
fcau
vmw
txt
eurozone
paris
probably
borrowing
decade
clue
reference
rout
beginning
12-year
oversupply
coincides
''all
eye
hop
'dovish
mea
culpa
tough
mike
van
dulken
accendo
chipmakers
wane
designer
arm
armh
dialog
dlg.f
austria
ams.s
britain
basf
bas.de
euro
18,911,407
emc
3-month
twenty-nine
thirty
mmm
insulate
lockheed
lmt
96.3.
fhfa
shiller
house
bring
10et
10,000
wtw
oprah
winfrey
reveal
fmer
huntington
hban
sanm
ak
rlyp
study
interaction
veltassa
oral
suspension
clinically
absorption
fcx
smaller-than-expected
enoc
pii
firstmerit
genesis
gen
13-year
nursing
chain
candidate
potassium
blood
in-vitro
bind
testing
cnc
hard-drives
contain
950,000
information-technology
tessco
te
four-year
networking
tess
ssys
sgoco
sgoc
16-month
macau
jinyi
protection
bus
tour
local
shopping
center
gamble
mecca
air
carbon-dioxide
emission
swft
ngvc
canaccord
genuity
ambac
ambc
insurer
jpmorgan
chase
dispute
mortgage-backed
nader
tavakoli
withdrawal
objection
rmbs
trustee
premium
fbc
crestwood
ceqp
instead
unitholders
arlp
musa
supercenter
walmart
unspecified
01/26/2016
26,165
tronic
ktcc
3,061,643
1,664,489
polycom
plcm
8,727,494
chubb
3,025,551
lannett
10,269,426
steel
19,640,704
58,215,579
vmware
102,036,749
1,979,929,007
era
nem.v
century
cye-h.v
african
afr.v
nobel
nel-un.v
blackheath
bhr.v
novra
nvi.v
parkside
ipd.v
apogee
ape.v
oramericas
oa-h.v
shoal
sgw.v
atico
aty.v
falco
fpc.v
jag.v
novateqni
ntq.v
alliancepharma
apa.v
regulus
reg.v
particular
member
iraq
interested
outside
regularly
follow-up
same-direction
handful
narrowed
declined
tank
then-consensus
settings
phone
trounce
spain
register
sizable
ine
intensify
macro-economic
underway
convene
fresnillo
e.on
commerzbank
underperformance
renew
border
stable
challenged
49th
parallel
overlap
season
tire-manufacturer
michelin
car-maker
electricity
schneider
brighten
sprint
coach
coh
96.2.
alliance
l.p
ebitda
assurance
aac
segregated
rmbs-related
litigation
affiliate
arise
insure
withdraw
object
leidos
ldos
segment
tax-efficient
morris
fully
repay
potentially
relypsa
volunteer
dosing
observe
binder
hyperkalemia
aratana
petx
early-stage
regulator
galliprant
pain
dog
osteoarthritis
animal
act
veterinarian
vitro
binding
five-day
cushion
heavy
iraqi
oil-producers
sub-
underscore
resilience
downwardly
96.0.
financing
p/case-shiller
richmond
dovish
england
governor
carney
16,177.74
1,905.13
4,574.83
canine
rambus
year-year-ago
separately
smart
card
identification
ecebs
ticket
forma
polaris
snowmobile
recreational
12-month
shrink
southwest
cswc
authorization
725,000
evep
preserve
explain
hedge
31.68/barrel
2.0445/lb
1,118.30/ounce
whitecap
wcp.to
telekom
skm
wireless
videocond2h
soufun
sfun
portal
netease
ntes
interactive
community
vipshop
vip
wns
luxembourg
koninklijke
philip
phg
randgold
accelerator
aaap
radiopharmaceutical
criteo
crto
non-opec
glut
othaim
nbk
riyal
calculation
union
payout
5,637
2,698
3,800
8,749
5,897
4,934
4,937
1,156
petromaroc
pma.v
nob.v
nmg.v
alloycorp
avt.v
hornby
hbe.v
communique
one.v
guerrero
gv.v
damley
dbl.v
ximen
xim.v
.miners
refuse
bloodbath
30.89/barrel
30.75/barrel
israeli
altair
appliance
allegiance
abtx
starwood
stwd
monro
muffler
brake
mnro
automotive
undercar
repair
tire
luxury
leather-goods
designer-retailer
snap
bottom-fishing
resurface
rail
freight
flash
up/
ati
wider-than-expected
immunogen
imgn
clinical-stage
milestone
clinical
anetumab
ravtansine
94-9343
mesothelioma
qiagen
n.v
qgen
netherlands-based
comprise
assay
bioinformatics
automation
quantiferon-tb
kit
availability
tuberculin
skin
cenovus
cve
canada-based
integrated
ubs
brief
momentarily
sympathy
fair
flight
goc
pick-up
pierce
slate
revision
labour
force
feature
revised
seasonal
minor
classification
alter
tame
897,301
3,461,428
2,317,705
pont
nemours
4,290,710
11,834,373
procter
12,145,103
nextel
12,395,217
corn
glw
15,210,415
21,143,954
tomorrow
factory
southwestern
weakening
dallas
manufacturing
disappoint
preceding
1,097.70
15,885.22
1,877.08
4,518.49
jst
fnof
silkwing
cray
supercomputer
sonexion
centre
medium-range
weather
qcco
voluntary
delist
omed
tarextumab
pancreatic
probability
statistically
survival
dash
12,146
eldorado
eld.to
greece
write-down
greek
suncor
su.to
controversial
trans-pacific
partnership
insist
ratify
chrystia
freeland
signing
12-country
treaty
zealand
step
table
parliament
debate
reclaim
1,100-an-ounce
1,105.30
1,108.90
self-insurance
bad-debt
associate
skilled
aside
slower-than-expected
catb
top-line
i/ii
cat-1004
duchenne
muscular
dystrophy
plasma
twitter
twtr
micro-blogging
website
jack
dorsey
katie
jacobs
stanton
kevin
weil
alex
roetter
brian
skip
schipper
enters
cross-license
year-ag0
billiom
mid-morning
vpco
one-fourth
chesapeake
chsp
below-consensus
ueps
transact24
391,645
comstock
crk
acreage
swap
haynesville
shale
drilling
louisiana
3,600
acre
cubic
divest
2,500
sdoc
transfer
occidental
30-year
remove
co2
01/25/2016
1,347,935
sanmina
1,695,423
crane
cey-h.v
imperial
iei.v
evrim
evm.v
nevada
sunrise
nev.v
ventripoint
vpt.v
marsa
mep.v
napier
nap.v
viridis
vrd.v
graphite
ngc.v
hauling
ave.v
achieve
31.19/barrel
30.92/barrel
corning
glass
betating
pile
warning
reward
frothy
cruise
rosetta
genomics
rosg
allowance
expression
signature
classify
kidney
tumor
distinguish
oncocytoma
renal
carcinoma
papillary
rcc
chromophobe
micrornas
detect
polymerase
demonstrated
inhibition
nf-kb
customer
russ
outweigh
freeport-mcmoran
frx
tuesay
case-shiller
20-city
96.5.
aig
spin
guaranty
advisor
separation
amgen
abp
biosimilar
humira
moderate-to-severe
plaque
psoriasis
rheumatoid
arthritis
spike
narrower-than-expected
postpaid
501,000.
lowest-ever
port
inter
parfums
ipar
reiterate
fragrance
iau
petmed
pet
jan
dot
gdot
immediate
leadership
prepaid
debit
letter
harvest
voice
mismanagement
destruction
steve
streit
intend
address
poor
operational
execution
inconsistent
ifo
climate
branch
mechanical
dollar-denominated
relies
partly
remark
abdalla
el-badri
secretary
organisation
bloc
collectively
speech
chatham
crucial
sanchez
amend
link
removal
pion
substantially
to107.3
vital
overhang
kingfisher
lloyds
heidelbergcement
alstom
lafargeholcim
oil-field
anticipation
reluctance
measure
jci
ireland-based
relocate
ireland
tax-inversion
mcdonald
all-day-breakfast
1,108.20
9,337.72
16,033.62
1,896.70
4,574.77
afmd
collaboration
tcy
aezs
90k
worsen
progression-free
trial
grub
negotiate
goldman
sachs
nvax
institutional
pour
oversupplied
hitting
secretary-general
abdullah
al-badri
urge
30.85/barrel
30.65/barrel
resilient
mitsubushi
trina
solar
tsl
e-payment
posco
pkx
qunar
qunr
0.,3
ing
groep
aegon
aeg
insurance
pension
natuzzi
ntz
furniture
dbv
dbvt
amarin
amtn
cerus
cea.v
firesteel
ftr.v
bcgold
bcg.v
9clz.v
park
ppk.v
reunion
rgd.v
cuo
xylitol
xyl.v
sustainable
comeback
renewed
rajhi
sunday
holiday
5,610
2,704
3,815
8,849
4,966
4,938
1,150
lakeland
lkfn
hawaii
boh
usual
blizzard
affect
east
coast
weekend
kimberly-clark
kmb
halliburton
hal
tweet
recruit
adam
responsibility
revenue-related
messinger
fabric
challenging
optimization
efficiency
calculate
vrx
brodalumab
monoclonal
antibody
pivotal
iii
clearance
disease
prescription
matter
non-members
31.16/barrel
31.18/barrel
thomson
smartestimates
constituent
toronto
fitbit
fit
retain
unable
10:30
culminate
merge
anad
compete
bidder
0.76-per-share
appoint
wsj
blrx
iib
bl-7010
celiac
accepts
bla
exec
nicolaus
cel
cytori
cytx
investigate
inject
subcutaneously
finger
impaired
scleroderma
schlumberger
cowen
face
unsettled
briskly
drift
spook
euronext
courage
yen
17,110.91
outnumber
hong
kong
eyed
up-day
mainland
19,340.14
shcomp
sino
doom
xinhua
speculative
vicious
mumbai
sensex
twse
korean
kospi
elevate
australian
p/asx
singapore
strait
thai
siam
tobacco
japay
tokyo
seafood
purveyor
maruha
nichiro
meiji
mejhf
electronics-maker
toshiba
tosbf
electronics-components
tdk
ttdky
computer-maker
lenovo
oil-giant
cnooc
internet-star
tencent
beer
shenhua
rekindle
aramco
khalid
al-fatih
sdrl
tlw
rdsb
totf
holiday-shortened
lone
wynn
wfm
enjoy
late-week
winter
storm
traffic
ipad
mario
draghi
reverberate
one-day
ecb
reporter
cheap
ail
spree
outperformer
distort
rule
enact
deluge
mid-week
unlikely
unleash
firework
up119.12
eght
bldp
stack
ipas
panasonic
avionics
csii
trov
axp
agrx
cardiovascular
needham
implementation
dual-franchise
progress
require
gbsn
convert
vasc
14-month
600,000
8x8
boom
mitl
dgii
starbucks
sbux
coffee
roughly
upholstery
plant
maiden
n.c.
173,000-square-foot
nearby
cnv
names
emmanuel
grenier
co-chief
quiroga
quits
duty
brazilian
cnova
comrcio
eletrnico
keefe
bruyette
issuer
gloomy
projected
oppenheimer
sivb
piper
jaffray
cuts
bmtc
legacy
lgcy
fixed-to-floating
redeemable
free
strip
pricing
credit-accretive
leverage
metric
glng
memorandum
understand
co-operate
greenfield
brownfield
pgh
ruckus
rkus
swedish
teliasonera
association
realtor
existing
month-on-month
bancorp
fitb
banc
asb
associated
hyatt
350-room
francisco
airport
mid-2019
traveler
trv
narrower-than-estimated
year-earlier
fy17
unveil
consolidated
accelerate
streamline
5.40-
mitel
normalized
iranian
hong-kong
nima
sanction
nuclear
lure
golar
lng
jointly
monetization
float
upstream
knowledge
uneconomic
hain
celestial
accounting
ross
weiner
organic
pursue
mr.
pasquale
conte
quantity
32nd
consecutive
rattle
mixture
dramatic
contrast
cnbc
definitely
premature
scheme
sport
direct
heidelberg
cement
hypermarket
carrefour
societe
generale
intuitive
isrg
wes
unit-holders
detrimental
stats
couple
51.0.
leading
permit
stoxx-50
react
positively
davos
holland
rds.a/rds.b
secure
1,098.90
9,367.55
16,013.62
1,896.53
4,562.69
5,900.01
9,764.88
4,336.69
16,958.53
19,080.51
2,916.56
8,487.32
5,620.16
11,815.58
xnpt
himax
himx
bitauto
bita
language
sify
industrials
macro
belski
bmo
strategist
emotion
spite
under-owned
globally
argue
increasingly
correlate
telco
grower
favour
likelihood
re-rate
stability
relx
renx
microchip
sap
terminate
lumileds
foreign
pearson
pso
phc-h.v
forent
fen.v
fjordland
fex.v
eq.v
peat
pet.v
olivut
olv.v
kiska
ksk.v
jackpot
jp.v
dios
dos.v
hint
shared
republic
rbcaa
ffbc
implement
shinzo
abe
asset-purchasing
markit
alphabet
search
bar
court
document
copyright
lawsuit
engine
oracle
orcl
attorney
hearing
involve
revenue-sharing
synchrony
syf
consumer-finance
shop
private-label
spin-off
arrangement
chk
doug
lawler
redirect
wal-mart
violate
dismiss
reinstate
ruling
judge
geoffrey
carter
protect
assert
invoke
attendance
discipline
incur
unexcused
absence
participate
abstract
abraxane
gemcitabine
foundation
first-line
asco
gastrointestinal
symposium
sportswear
colm
distribute
outerwear
robert
baird
nexstar
nxst
broadcasting
buoyant
encourage
spill
results/guidance
amex
saar
fy2016
sbny
newlink
genetics
nlnk
indoximod
gemcitabine/nab-paclitaxel
allergan
agn
botox
limb
spasticity
bps
shot
pboc
yuan
calm
cpi
ecb-inspired
risk-on
nymex
realm
commodity-related
rouble
aussie
kiwi
buck
principal
easing
unravel
01/22/2016
74,356
legg
mason
84,441
rockwell
collins
col
543,722
sotheby
557,647
kansa
ksu
8,462,027
28,994,456
resuscitate
deploy
16,000.
compromise
amplify
short-covering
overseas
293,000
philadelphia
conversion
suite
monitoring
outline
simplify
glad
xlnx
egl
alks
depressive
primary
endpoint
schl
tender
loonie
12,035
stance
railway
cp.to
1,000
cseries
jetliner
materialize
aviva
15-year
refer
oversold
attack
libyan
terminal
remind
march-dated
log
victim
selloff
1,098.20
1,106.20
factset
endocyte
ecyt
indiana
prejudice
plaintiff
amended
pleading
dismissal
america
choice
ctdna
topline
midst
unwired
planet
upip
intellectual
infringement
suit
samsung
huawei
dusseldorf
district
judgment
cellular
infringe
owe
kingdom
fee-shifting
plxs
imo
-owned
chipmos
survive
itt
educational
esi
for-profit
educator
probe
accusation
improperly
title
aid
vigorously
false
disgruntled
lay
4,000
workforce
nine-year
gladstone
idea
prepared
favorable
cubi
improves
mtg
kind
internally
nrp
saex
award
onshore
logistical
seismic
01/21/2016
420,281
3,082,738
celanese
5,078,673
resmed
rmd
26,985,668
31,771,027
64,237,015
103,458,586
12,013.
opt
jet
penultimate
increased
roil
quantitative
stimulate
necessary
possibly
reconsider
deposit
marginal
press
originally
envision
gbp
lufthansa
dialysis
car-makers
wine
spirit
tvix
plummeting
eia
avon
avp
tcbi
sequentially
pengrowth
cad
59,000
61,000
boe/d
maintenance
contemplate
71,409
70,000
72,000
disposition
63,100
alkermes
mdd
pre-specified
once-daily
depression
bourses
1,094.60
9,230.33
1,886.77
4,530.08
5,773.79
9,574.16
4,206
16,017.26
18,542.15
2,880.48
8,244.86
5,567.50
11,690.99
feye
isight
unp
pdc
pdce
proved
diplomat
pharmacy
dplo
filling
cosentx
interleukin
antagonist
ankylose
spondylitis
psoriatic
approved
fitness
cybex
fold
xilinx
just-concluded
moshe
gavrielov
blame
energy-related
non-performing
lhi
shortly
momo
mobile-based
baidu
bidu
chinese-language
logitech
logi
specialize
34p
52p
syngenta
syt
agribusiness
seed
midatech
mtp
closed-end
prudential
puk
outpace
lifecos
gwo
iag
mfc
hurt
slf
27bps
23bps
core/underlying
clearly
and/or
multiple
contraction
scenario
roe
year-end
bvps
2-3
stabilization
p/bv
regression
risk/reward
-bmo
onerous
50bps
20bps
manageable
stabilizes
-under
returning
35+
substantial
-p/bv
sensitivity
notable
0.94x
0.8x
1.68x
1.6x
savola
arabian
ma'aden
fawaz
alhokair
emaar
5,464
2,622
3,737
8,584
5,713
sept
4,867
4,946
1,165
tesoro
tes.v
rtm.v
cordy
ckk.v
nel-un.to
qic.v
vanstar
vsr.v
carbonone
cx.v
ginsms
gok.v
verizon
shade
macquarie
tcp
tcpc
tiffany
tif
men
wearhouse
closer
300,000
275,000.
283,000.
267,000
4.0.
3.5.
zfgn
fbr
luv
th
ual
passenger
agios
agio
acelrx
acrx
comprehensive
sublingual
sufentanil
mcg
outpatient
abdominal
slew
275,000
284,000
precede
ensue
eking
tight
slimmed
158,228
169,342
660,730
keycorp
narrower
apri
closure
squeeze
fy07
inspire
lasted
nose
bet
vigorous
narrowing
collect
expanded
ttrade
sizeable
translate
500-plus
ignite
fdi
deterioration
specifically
core-cpi
indicating
negatively
influence
encouraging
builder
upwardly
netflix
nflx
275k
284k
obesity
co-primary
tgd
obtain
state-backed
syn
irritable
bowel
syndrome
syn-010
heb
orphan
status
mers
kone
nvcr
reversing
promise
ampliphi
bioscience
aphb
dose
ab-sa01
staphylococcus
aureus
rhinosinusitis
antibiotic
enrol
inflammation
sinuses
infect
mid-year
zaf-311
body
hyperphagia-related
behavior
fldm
ocean
optt
alternative-energy
apb350
powerbuoy
kilowatt
jersey
communicate
meteorological
station
24-hour
cree
asti
newly
designate
redwood
reed
craft
soda
nls
bowflex
max
trainer
schwinn
airdyne
bike
australia
race
exit
llc
realize
lien
oksb
veritas
wgp
wunderlich
clmt
wpx
maturity
01/20/2016
11,890,287
23,703,547
37,363,044
ffiv
poor's/tsx
11,739
13th
enerplus
erf.to
leg
contributing
slow-down
beijing
appetite
destatis
eurostat
dominate
accor
axa
agricole
dust
ery
widely
stabilize
treehouse
underwritten
underwriter
over-allotments
conagra
cag
sharer
tangible
actuarial
mark-to-market
loer
prespecified
methane
constipation
pws
stream
video
subscription
ibkr
repeat
insert
omit
-sign
paragraph
tailspin
500-point
feeding
frenzy
compound
annualized
1,103.90
8,969.06
15,474.66
4,318.54
topeka
carbo
crr
17-year
prolonged
gary
kolstad
foresee
tayyar
aljazira
osool
bakheet
khodari
arab
qnb
5,460
5,777
2,639
3,768
8,689
4,891
4,985
1,168
taiwanese
kingtone
wirelessinfo
o2micro
oiim
crystal
emit
diode
writing
asml
less-aggressive
restatement
lofty
enthusiasm
convincing
afer
deepen
suffer
jci-h.v
terra
nova
tgc.v
proteome
apc.v
pge.v
sop.v
pelangio
px.v
mmv.v
interna
itm.v
equatorial
exx.v
energulf
eng.v
deepens
shoulder
boc
wholesale
sub
guggenheim
broadsoft
bsft
fargo
slowest
longer
recede
inflation-adjusted
hourly
wage
applicable
pre-tax
reduced
principle
resolve
investigation
fraud
enforcement
shlx
gnc
company-owned
zafgen
beloranib
prader-willi
hyperphagia
excessive
hunger
hallmark
discussion
seriously
benefit/risk
high-risk
obese
population
metlife
bankshares
ubsh
drown
27.90/barrel
27.61/barrel
spls
depot
odp
waive
termination
death
spiral
wan
brunt
risk-off
subside
exception
symc
oncolytics
oncy
band
regeneron
regn
vigor
mpr
economics
round
8.30am
neflix
1,118,136
brinker
eat
4,954,312
29,390,850
25-year
imf
shot-in-the
unite
unh
1,086.40
16,016.02
1,881.33
4,476.95
biti
acorda
acor
rse
brookfield
bam
bam-un.to
bpy
bpy-un.to
macrilen
ghrelin
agonist
hormone
deficiency
ebio
isunakinra
ocular
itching
commission
inquiry
accuracy
fracmax
defendant
cwei
non-producing
concho
cxo
farm-out
biotie
early-state
tozadenant
adenosine
a2a
receptor
parkinson
adjunct
regimen
levodopa
carbidopa
infosonics
ifon
next-generation
phablet
update
cyrus
cyprus
lte
dimensional
screen
rear
camera
led
encase
uni-body
equip
equal-weight
hdp
shelf
registration
yet-to-be-determined
ally
dgly
taser
respective
body-worn
frivolous
egregious
examination
ally'a
strengthen
tasr
aaww
privately
florida
earning
prty
equalweight
oha
ohai
steven
wayne
succeed
bam-a.to
uihc
jmp
perfrom
petrobras
pbr
state-owned
celp
raymond
james
01/19/2016
371,086
nautilus
1,141,046
8,556,355
linear
lltc
steeper
milder
theh
error
inaccurate
punish
heavier
disappear
11,604,950
micro
36,849,587
261,743,151
machine
862,999,242
egaux
cpe-h.v
dolly
varden
dv.v
lancaster
lhc.v
terrace
tzr.v
arc
sa.v
sierra
ore
naa.v
jemi
fibre
jfi.v
magor
mcc.v
aurora
asg.v
dmd
connection
dmg-h.v
rsi
rsy.v
neutrisci
nu.v
wealth
wml.v
dynacert
dya.v
alabama
alp.v
alvopetro
alv.v
largo
lgo.v
worse
opposite
28.99/barrel
28.57/barrel
1.9755/lb
exceeded
kite
investigator
novel
orally-active
sharpspring
shsp
recur
s-3
oriental
edu
surplus
solvency
foley
clayton
williams
lease
william
burleson
cnf
completion
chemistry
inched
stumble
rouse
unsolicited
worth
estimated
proposal
solicit
commit
maximize
moderately
surveillance
law
homeland
validity
auto-activation
allege
willful
axon
58,115
catarina
46,030
cotulla
tony
targa
ngls
cryogenic
high-pressure
gathering
aeterna
zentaris
macimorelin
aghd
confirmatory
rapidly
physician
boast
prep
carve
fly
fy13
pre-announced
struggle
performing
prepare
1,086.50
9,319.77
16,046.98
1,885.15
4,489.22
crdc
microcutter
conduct
canf
sexual
dysfunction
hgt
fy06
regular-hours
departure
rely
importer
belgium
malta
tourism
tui
athletic
lifestyle
distributor
kering
post-bell
composure
swoon
eventually
tighten
stir
consequently
29.47/barrel
1.9795/lb
all-sector
ctrip.com
ctrp
21vianet
vnet
automobile
the9
ncty
jrjc
web-based
telefonaktiebolaget
ericcson
cuk
vacation
voxeljet
vjet
three-dimensional
printer
jersey-based
bupa
alinma
amer
riyad
orascom
masraf
rayan
5,746
6,097
8,987
2,766
3,889
4,982
5,084
1,176
adex
adx.v
relevium
rlv.v
eurotin
tin.v
shield
nrn.v
afe.v
almo
apt.v
lowell
jdl.v
algold
alg.v
sup.v
intelligent
mchp
asset-purchase
optimistic
29.48/barrel
29.58/barrel
mackinac
mfnc
mbank
eagle
river
accretive
escalate
jewelry
two-month
dunkin
dnkn
franchisor
quick
blair
shorten
upgrades
underweight
ups
dal
bsi
affirms
zpin
going-private
leukemia
arwr
congenital
alpha-1
antitrypsin
bbry
win
veteran
affair
investigator-initiated
fistula-in-ano
crohn
can-fite
biopharma
0.93per
cabot
cog
dismal
mid
y/y
pronounced
ignited
2,202,926
unitedhealth
9,704,331
delta
20,276,602
126,077,432
broad-based
nod
curtail
nation
28.62/barrel
28.94/barrel
anderson
axl.to
latin
lat.v
avagenesis
vva.v
pearl
prh.v
onenergy
oeg.v
margaux
mrl.v
barsele
bme.v
yoho
yo.v
bcm
b.v
enviro
stt.v
energold
egd.v
sky
ridge
syr-h.v
mobio
mbo.v
12,000
ban
28.67/barrel
29.02/barrel
barker
bml.v
sensio
sio.v
cameco
cru.v
prodigy
pgv.v
butte
ben.v
sun
ssi.v
pistol
pst.v
cents.
imaging
idl.v
renaissance
ren.v
lifting
cartel
impose
28.87/barrel
29.24/barrel
devalue
dim
intel
intc
permeate
dive
magnifying
especially
empire
up/down
xxx
sfx
square
srpt
biomarin
bmrn
nda
15-month
money-center
citibank
enroute
data-center
double-digit
top-
bottom-line
impax
labatories
ipxl
overcame
downward
supplemental
emverm
100-milligram
chewable
pinworm
merrill
concludes
eteplirsen
statistical
evidence
mutation
hole
microsemi
mscc
pmc-sierra
pmcs
29.81-a-share
cdrb
non-binding
intent
aegis
identity
vitamin
shoppe
vsi
dietary
supplement
documentary
pb
frontline
nyt
attention
unscrupulous
sean
naughton
grocer
sprout
farmer
sfm
request
no-shop
exclusively
psg
wedbush
blackrock
blk
glbz
ahp
sessa
nominates
failure
unshakable
burden
pbf
break-even
lei
mid-continent
semg
unnamed
grade
wapiti
briefing
sarepta
skepticism
fulfil
proof
respect
devastate
illness
effectiveness
guest
peripheral
advisory
background
carefully
approvability
rare
pediatric
mint
mit.v
galantas
gal.v
cumo
mly.v
quest
gq.v
timberline
tbr.v
sucampo
scmp
13-month
inc.to
commercialize
cpp-1x
sulindac
promissory
mature
unless
prepay
acu.v
solarvest
bioenergy
svs.v
goldsource
gxs.v
matachewan
mcm-a.v
arht
art.v
agility
ahi.v
eestor
esu.v
quattro
qxp.v
persistent
freeze
pre.to
writedowns
unfavourable
markets/rates
strengthening
after-tax
0.98/share
6-7
compute
climbed
mid-
high-single
roth
q4/15
10th
manulife
lifeco
11th
cad/usd
q1/16
aum
fine
2016/2017
tps
geopolitical
qoq
comp
q4/14
policyholder
elevated
epr
build-to-suit
nominate
asia-pacific
blackberry
enterprise-wide
alert
pager
fax
desktop
smartphones
integration
notification
enable
collection
navy
spawar
personnel
accountability
assessment
470-485
boe
rmb
aim
competitive
profitability
pruden
russell
mlp
one-on-one
master
utah
depreciation
amortization
exert
vast
contributor
category
footwear
recreation
culture
rest
hargreaves
lansdown
solvay
aircraft
indices
huge
bail
motion
chain-reaction
spark
flammable
ppi
time-frame
shocker
4.00.
utilization
1,089.60
9,227.39
15,853.44
1,860.82
4,425.74
30/bbl
curb
freedom
29.56/barrel
29.62/barrel
jinkosolar
jks
module
optronics
auo
gravity
grvy
publisher
thailand
jupai
techfaith
cntf
materialise
mtls
belgian
printing
finnish
sygenta
empower
ept.v
3.bullion
bgd.v
hunter
agh.v
lion
nl.v
bioneutra
bga.v
tenth
avenue
tpc.v
stockport
spt.v
29.51/barrel
29.50/barrel
walt
disney
rlh
franchise
9:15
primarily
partially
usd3.3
usd1.02
usd344
usd0.06
cva/dva
usd1.06
usd1.05
usd18.6
citi
citicorp
translation
usd17.87
dsme
shipyard
defer
ultra-deepwater
drillships
aquila
libra
suppose
yard
installment
ship
capex
nike
nke
apparel
sponsorship
ohio
austin
11-year
vioxx
damage
constitute
admission
wrongdoing
threaten
4-month
impend
hemorrhage
ebola
leone
wake
rejection
heron
hrtx
notify
sustol
creep
offshore
contractor
reversed
01/15/2016
198,074
259,636
pnc
2,366,561
39,789,409
67,409,330
eight-day
losing
streak
louis
jam
bullard
derail
7,000
first-time
less-than-0.5
participant
bargain
year-opening
1,073.60
16,379.05
1,921.84
4,615.00
mega
re-purchases
338,436
permanent
proton
hnsn
licensing
refinance
preferential
exercisable
gpro
rid
hospital
radiation
mevion
s250
ams
ipci
bioequivalence
abuse
deterrent
rexista
oxycodone
formulation
jumping
solarcity
scty
solar-powered
grid
compensate
ask
homeowner
inap
ubnt
bernstein
alon
squarter
nis1.65
cmg
campaign
coli
boutique
e-spectrum
tree
surveyor
turn-around
entirely
dedicate
dependence
jean-georges
malcor
atls
de-listed
llex
ronald
ormand
nuno
brandolini
glenn
dawson
tyler
runnel
01/14/2016
220,518,738
regardless
pop
expectaitons
multi-billion
clung
slyce
slc.v
yangaroo
yoo.v
azimut
azm.v
aequus
aqs.v
vitreous
vci.v
divergent
dvg.v
newswires
tentative
norm
leaner
eke
subdue
pare
cancana
cny.v
sdx
sdx.v
roe.v
zinc
czx.v
avante
logixx
xx.v
ultra
lithium
uli.v
klondike
kg.v
31.05/barrel
31.32/barrel
webmd
wbmd
negotiation
walgreens
boot
wba
familiar
ambarella
amba
gopro
year-ending
specify
wearable-camera
observer
generates
supplier
compression
image
fortune
wearable
similarly
undercut
conversely
ski
hill
vail
mtn
season-to-date
din
school
skier
visit
snow
xxx.xx
extra
exr
regular-market
re-calibration
shuffling
midcap
concrete
uscr
smallcap
casualty
ace
ticker
symbol
declide
antero
low-pressure
volumes
seat
284,000.
israel
bsre
tel
aviv
capitalization
nis1.32
acceptance
contingent
diligence
desjardins
buzzfeed
advertising-sales
automated
iad
transocean
rig
norwegian
police
shelve
appeal
acquit
decade-long
driller
adviser
innocent
oslo
dismissed
prosecution
nok
intellipharmaceutics
oxycontin
exhibit
batch
requirement
harmonised
price-adjusted
intercontinental
merlin
hikma
daimler
bmw
mild
worried
worrisome
1,080.70
9,460.38
16,353.92
4,587.59
china-based
treerly
bgfv
clsa
52-wk
fbn
northland
-5,4
milan
bby
yelp
riley
auy
sooner
30.82/barrel
31/barrel
pmt.to
economist
lpl
tsm
circuit
photovoltaic
ikang
kang
preventive
e-commerce
dangdang
dang
business-to-consumer
geophysical
fwp
ihg
ryanair
ryaay
dump
egyptian
devaluation
perilously
publish
kayan
petrochemical
ncb
halwani
brother
5,838
5,858
3,955
2,815
9,185
5,113
5,266
1,201
axmin
axm.v
sunset
spk.v
lamelee
lir.v
hemisphere
hme.v
otis
ooo.v
makena
mkn.v
avarone
avm.v
mnp
mnp.v
wai
wai.v
digimarc
dmrc
barcodes
invisible
watermarking
printed
packaging
photo
textbook
mantech
mant
defense
terminology
compatible
stand-alone
pc-based
realty
frt
neighborhood
allocable
bluerock
brg
apartment
320-unit
citation
club
palmer
ranch
368-unit
summer
wind
naples
125,000
31.06/barrel
terror
jakarta
skyline
horizon
hznp
crealta
karyopharm
kpti
2/3
selinexor
liposarcoma
cling
277,0000.
270,000
310,000
asa
37,101,561
lundin
correspond
sek
277,000
13,376
shiloh
shlo
4,777,959
73,288,159
rack
brutal
plague
300-plus
retrace
lackluster
beige
tolerate
dampens
2,000
cybr
chkp
hlth
nhtc
refute
allegation
ctrip
minority
gkos
espr
bempedoic
acid
hyperlipidemia
wmb
ete
bwa
csx
disappoints
sagent
sgnt
injection-drugs
perella
weinberg
15.78-a-share
acst
sinking
arw
17-month
traction
cadence
cdns
engineer
print
siliconexpert
orcad
day-long
marker
sustain
cayman
island
ordinary
esca
axl
lasalle
lho
low-water
convince
walk
trouble
quote
aylesworth
'no
thank
fitch
moody
rung
junk
7.40-a-share
nat
pagp
01/13/2016
1,211,904
fuller
ful
malbex
mbg.v
petro
prj.v
karmin
kar.v
killdeer
kmi-h.v
matrrix
mxx.v
xpel
dap-u.v
why.v
centurion
ctn.v
battle
bmg.v
rockhaven
rk.v
jericho
jco.v
30.52/barrel
30.46/barrel
shock
induce
shouldlead
higher-than-average
contributions.however
2016.following
25bps
innovation
srty
bzq
stag
practically
mimedx
mdxg
tennessee-based
